hello-robot/stretch_firmware/arduino/hardware/hello-robot/samd/boards.txt
menu.cache=Cache
menu.speed=CPU Speed
menu.opt=Optimize
menu.maxqspi=Max QSPI
menu.usbstack=USB Stack
menu.debug=Debug

# Hello Pimu
# ---------------------------------------
hello_pimu.name=Hello Pimu
hello_pimu.vid.0=0x2341
hello_pimu.pid.0=0x804d
hello_pimu.vid.1=0x2341
hello_pimu.pid.1=0x804d

hello_pimu.vid.2=0x2341
hello_pimu.pid.2=0x824d
# If the board is a 2341:824d use 2341:824d for build and set other parameters as well
hello_pimu.vid.2.build.vid=0x2341
hello_pimu.vid.2.build.pid=0x824d
hello_pimu.vid.2.build.usb_product="Hello Pimu"
hello_pimu.vid.2.bootloader.file=zero/samd21_sam_ba_genuino.bin

hello_pimu.vid.3=0x2341
hello_pimu.pid.3=0x024d
# If the board is a 2341:024d use 2341:824d for build and set other parameters as well
hello_pimu.vid.3.build.vid=0x2341
hello_pimu.vid.3.build.pid=0x824d
hello_pimu.vid.3.build.usb_product="Hello Pimu"
hello_pimu.vid.3.bootloader.file=zero/samd21_sam_ba_genuino.bin

hello_pimu.upload.tool=bossac
hello_pimu.upload.protocol=sam-ba
hello_pimu.upload.maximum_size=262144
hello_pimu.upload.use_1200bps_touch=true
hello_pimu.upload.wait_for_upload_port=true
hello_pimu.upload.native_usb=true
hello_pimu.build.mcu=cortex-m0plus
hello_pimu.build.f_cpu=48000000L
hello_pimu.build.usb_product="Hello Pimu"
hello_pimu.build.usb_manufacturer="Hello Robot Inc"
hello_pimu.build.board=SAMD_ZERO
hello_pimu.build.core=arduino
#Define for Adafruit to allow Zero Neopixel DMA library to work
hello_pimu.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags} -D ARDUINO_SAMD_ADAFRUIT
hello_pimu.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
hello_pimu.build.openocdscript=openocd_scripts/arduino_zero.cfg
hello_pimu.build.variant=hello_pimu
hello_pimu.build.variant_system_lib=
hello_pimu.build.vid=0x2341
hello_pimu.build.pid=0x804d
hello_pimu.bootloader.tool=openocd
hello_pimu.bootloader.file=zero/samd21_sam_ba.bin

# Hello Wacc
# ---------------------------------------
hello_wacc.name=Hello Wacc
hello_wacc.vid.0=0x2341
hello_wacc.pid.0=0x804d
hello_wacc.vid.1=0x2341
hello_wacc.pid.1=0x804d

hello_wacc.vid.2=0x2341
hello_wacc.pid.2=0x824d
# If the board is a 2341:824d use 2341:824d for build and set other parameters as well
hello_wacc.vid.2.build.vid=0x2341
hello_wacc.vid.2.build.pid=0x824d
hello_wacc.vid.2.build.usb_product="Hello Wacc"
hello_wacc.vid.2.bootloader.file=zero/samd21_sam_ba_genuino.bin

hello_wacc.vid.3=0x2341
hello_wacc.pid.3=0x024d
# If the board is a 2341:024d use 2341:824d for build and set other parameters as well
hello_wacc.vid.3.build.vid=0x2341
hello_wacc.vid.3.build.pid=0x824d
hello_wacc.vid.3.build.usb_product="Hello Wacc"
hello_wacc.vid.3.bootloader.file=zero/samd21_sam_ba_genuino.bin

hello_wacc.upload.tool=bossac
hello_wacc.upload.protocol=sam-ba
hello_wacc.upload.maximum_size=262144
hello_wacc.upload.use_1200bps_touch=true
hello_wacc.upload.wait_for_upload_port=true
hello_wacc.upload.native_usb=true
hello_wacc.build.mcu=cortex-m0plus
hello_wacc.build.f_cpu=48000000L
hello_wacc.build.usb_product="Hello Wacc"
hello_wacc.build.usb_manufacturer="Hello Robot Inc"
hello_wacc.build.board=SAMD_ZERO
hello_wacc.build.core=arduino
hello_wacc.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
hello_wacc.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
hello_wacc.build.openocdscript=openocd_scripts/arduino_zero.cfg
hello_wacc.build.variant=hello_wacc
hello_wacc.build.variant_system_lib=
hello_wacc.build.vid=0x2341
hello_wacc.build.pid=0x804d
hello_wacc.bootloader.tool=openocd
hello_wacc.bootloader.file=zero/samd21_sam_ba.bin


# Hello Stepper
# ---------------------------------------
hello_stepper.name=Hello Stepper
hello_stepper.vid.0=0x2341
hello_stepper.pid.0=0x804d
hello_stepper.vid.1=0x2341
hello_stepper.pid.1=0x804d

hello_stepper.vid.2=0x2341
hello_stepper.pid.2=0x824d
# If the board is a 2341:824d use 2341:824d for build and set other parameters as well
hello_stepper.vid.2.build.vid=0x2341
hello_stepper.vid.2.build.pid=0x824d
hello_stepper.vid.2.build.usb_product="Hello Stepper"
hello_stepper.vid.2.bootloader.file=zero/samd21_sam_ba_genuino.bin

hello_stepper.vid.3=0x2341
hello_stepper.pid.3=0x024d
# If the board is a 2341:024d use 2341:824d for build and set other parameters as well
hello_stepper.vid.3.build.vid=0x2341
hello_stepper.vid.3.build.pid=0x824d
hello_stepper.vid.3.build.usb_product="Hello Stepper"
hello_stepper.vid.3.bootloader.file=zero/samd21_sam_ba_genuino.bin

hello_stepper.upload.tool=bossac
hello_stepper.upload.protocol=sam-ba
hello_stepper.upload.maximum_size=262144
hello_stepper.upload.use_1200bps_touch=true
hello_stepper.upload.wait_for_upload_port=true
hello_stepper.upload.native_usb=true
hello_stepper.build.mcu=cortex-m0plus
hello_stepper.build.f_cpu=48000000L
hello_stepper.build.usb_product="Hello Stepper"
hello_stepper.build.usb_manufacturer="Hello Robot Inc"
hello_stepper.build.board=SAMD_ZERO
hello_stepper.build.core=arduino
hello_stepper.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
hello_stepper.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
hello_stepper.build.openocdscript=openocd_scripts/arduino_zero.cfg
hello_stepper.build.variant=hello_stepper
hello_stepper.build.variant_system_lib=
hello_stepper.build.vid=0x2341
hello_stepper.build.pid=0x804d
hello_stepper.bootloader.tool=openocd
hello_stepper.bootloader.file=zero/samd21_sam_ba.bin



# -----------------------------------
# Hello-Robot Hello_Pimu2 (SAMD51)
# -----------------------------------
hello_robot_hello_pimu2.name=Hello-Robot Hello_Pimu2 (SAMD51)

# VID/PID for Bootloader, Arduino & CircuitPython
hello_robot_hello_pimu2.vid.0=0x239A
hello_robot_hello_pimu2.pid.0=0x8022
hello_robot_hello_pimu2.vid.1=0x239A
hello_robot_hello_pimu2.pid.1=0x0022
hello_robot_hello_pimu2.vid.2=0x239A
hello_robot_hello_pimu2.pid.2=0x8026

# Upload
hello_robot_hello_pimu2.upload.tool=bossac18
hello_robot_hello_pimu2.upload.protocol=sam-ba
hello_robot_hello_pimu2.upload.maximum_size=507904
hello_robot_hello_pimu2.upload.offset=0x4000
hello_robot_hello_pimu2.upload.use_1200bps_touch=true
hello_robot_hello_pimu2.upload.wait_for_upload_port=true
hello_robot_hello_pimu2.upload.native_usb=true

# Build
hello_robot_hello_pimu2.build.mcu=cortex-m4
hello_robot_hello_pimu2.build.f_cpu=120000000L
hello_robot_hello_pimu2.build.usb_product="Hello_Pimu"
hello_robot_hello_pimu2.build.usb_manufacturer="Hello-Robot"
hello_robot_hello_pimu2.build.board=HELLO_PIMU
hello_robot_hello_pimu2.build.core=arduino
hello_robot_hello_pimu2.build.extra_flags=-D__SAMD51J19A__ -DHELLOROBOT_HELLO_PIMU -D__SAMD51__ -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16 {build.usb_flags}
hello_robot_hello_pimu2.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
hello_robot_hello_pimu2.build.openocdscript=scripts/openocd/daplink_samd51.cfg
hello_robot_hello_pimu2.build.variant=hello_pimu
hello_robot_hello_pimu2.build.variant_system_lib=
hello_robot_hello_pimu2.build.vid=0x239A
hello_robot_hello_pimu2.build.pid=0x8022
hello_robot_hello_pimu2.bootloader.tool=openocd
hello_robot_hello_pimu2.bootloader.file=/hello_pimu/bootloader-hello_pimu-v3.16.0-15-gaa52b22-dirty.bin
hello_robot_hello_pimu2.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16

# Menu: Cache
hello_robot_hello_pimu2.menu.cache.on=Enabled
hello_robot_hello_pimu2.menu.cache.on.build.cache_flags=-DENABLE_CACHE
hello_robot_hello_pimu2.menu.cache.off=Disabled
hello_robot_hello_pimu2.menu.cache.off.build.cache_flags=

# Menu: Speed
hello_robot_hello_pimu2.menu.speed.120=120 MHz (standard)
hello_robot_hello_pimu2.menu.speed.120.build.f_cpu=120000000L
hello_robot_hello_pimu2.menu.speed.150=150 MHz (overclock)
hello_robot_hello_pimu2.menu.speed.150.build.f_cpu=150000000L
hello_robot_hello_pimu2.menu.speed.180=180 MHz (overclock)
hello_robot_hello_pimu2.menu.speed.180.build.f_cpu=180000000L
hello_robot_hello_pimu2.menu.speed.200=200 MHz (overclock)
hello_robot_hello_pimu2.menu.speed.200.build.f_cpu=200000000L

# Menu: Optimization
hello_robot_hello_pimu2.menu.opt.small=Small (-Os) (standard)
hello_robot_hello_pimu2.menu.opt.small.build.flags.optimize=-Os
hello_robot_hello_pimu2.menu.opt.fast=Fast (-O2)
hello_robot_hello_pimu2.menu.opt.fast.build.flags.optimize=-O2
hello_robot_hello_pimu2.menu.opt.faster=Faster (-O3)
hello_robot_hello_pimu2.menu.opt.faster.build.flags.optimize=-O3
hello_robot_hello_pimu2.menu.opt.fastest=Fastest (-Ofast)
hello_robot_hello_pimu2.menu.opt.fastest.build.flags.optimize=-Ofast
hello_robot_hello_pimu2.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
hello_robot_hello_pimu2.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops

# Menu: QSPI Speed
hello_robot_hello_pimu2.menu.maxqspi.50=50 MHz (standard)
hello_robot_hello_pimu2.menu.maxqspi.50.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
hello_robot_hello_pimu2.menu.maxqspi.fcpu=CPU Speed / 2
hello_robot_hello_pimu2.menu.maxqspi.fcpu.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})

# Menu: USB Stack
hello_robot_hello_pimu2.menu.usbstack.arduino=Arduino
hello_robot_hello_pimu2.menu.usbstack.tinyusb=TinyUSB
hello_robot_hello_pimu2.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB

# Menu: Debug
hello_robot_hello_pimu2.menu.debug.off=Off
hello_robot_hello_pimu2.menu.debug.on=On
hello_robot_hello_pimu2.menu.debug.on.build.flags.debug=-g


# -----------------------------------
# Hello-Robot Hello_Stepper2 (SAMD51)
# -----------------------------------
hello_robot_hello_stepper2.name=Hello-Robot Hello_Stepper2 (SAMD51)

# VID/PID for Bootloader, Arduino & CircuitPython
hello_robot_hello_stepper2.vid.0=0x239A
hello_robot_hello_stepper2.pid.0=0x8022
hello_robot_hello_stepper2.vid.1=0x239A
hello_robot_hello_stepper2.pid.1=0x0022
hello_robot_hello_stepper2.vid.2=0x239A
hello_robot_hello_stepper2.pid.2=0x8026

# Upload
hello_robot_hello_stepper2.upload.tool=bossac18
hello_robot_hello_stepper2.upload.protocol=sam-ba
hello_robot_hello_stepper2.upload.maximum_size=507904
hello_robot_hello_stepper2.upload.offset=0x4000
hello_robot_hello_stepper2.upload.use_1200bps_touch=true
hello_robot_hello_stepper2.upload.wait_for_upload_port=true
hello_robot_hello_stepper2.upload.native_usb=true

# Build
hello_robot_hello_stepper2.build.mcu=cortex-m4
hello_robot_hello_stepper2.build.f_cpu=120000000L
hello_robot_hello_stepper2.build.usb_product="Hello_Stepper"
hello_robot_hello_stepper2.build.usb_manufacturer="Hello-Robot"
hello_robot_hello_stepper2.build.board=HELLO_STEPPER
hello_robot_hello_stepper2.build.core=arduino
hello_robot_hello_stepper2.build.extra_flags=-D__SAMD51J19A__ -DHELLOROBOT_HELLO_STEPPER -D__SAMD51__ -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16 {build.usb_flags}
hello_robot_hello_stepper2.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
hello_robot_hello_stepper2.build.openocdscript=scripts/openocd/daplink_samd51.cfg
hello_robot_hello_stepper2.build.variant=hello_stepper
hello_robot_hello_stepper2.build.variant_system_lib=
hello_robot_hello_stepper2.build.vid=0x239A
hello_robot_hello_stepper2.build.pid=0x8022
hello_robot_hello_stepper2.bootloader.tool=openocd
hello_robot_hello_stepper2.bootloader.file=/hello_stepper/bootloader-hello_stepper-v3.16.0-15-gaa52b22-dirty.bin
hello_robot_hello_stepper2.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16

# Menu: Cache
hello_robot_hello_stepper2.menu.cache.on=Enabled
hello_robot_hello_stepper2.menu.cache.on.build.cache_flags=-DENABLE_CACHE
hello_robot_hello_stepper2.menu.cache.off=Disabled
hello_robot_hello_stepper2.menu.cache.off.build.cache_flags=

# Menu: Speed
hello_robot_hello_stepper2.menu.speed.120=120 MHz (standard)
hello_robot_hello_stepper2.menu.speed.120.build.f_cpu=120000000L
hello_robot_hello_stepper2.menu.speed.150=150 MHz (overclock)
hello_robot_hello_stepper2.menu.speed.150.build.f_cpu=150000000L
hello_robot_hello_stepper2.menu.speed.180=180 MHz (overclock)
hello_robot_hello_stepper2.menu.speed.180.build.f_cpu=180000000L
hello_robot_hello_stepper2.menu.speed.200=200 MHz (overclock)
hello_robot_hello_stepper2.menu.speed.200.build.f_cpu=200000000L

# Menu: Optimization
hello_robot_hello_stepper2.menu.opt.small=Small (-Os) (standard)
hello_robot_hello_stepper2.menu.opt.small.build.flags.optimize=-Os
hello_robot_hello_stepper2.menu.opt.fast=Fast (-O2)
hello_robot_hello_stepper2.menu.opt.fast.build.flags.optimize=-O2
hello_robot_hello_stepper2.menu.opt.faster=Faster (-O3)
hello_robot_hello_stepper2.menu.opt.faster.build.flags.optimize=-O3
hello_robot_hello_stepper2.menu.opt.fastest=Fastest (-Ofast)
hello_robot_hello_stepper2.menu.opt.fastest.build.flags.optimize=-Ofast
hello_robot_hello_stepper2.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
hello_robot_hello_stepper2.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops

# Menu: QSPI Speed
hello_robot_hello_stepper2.menu.maxqspi.50=50 MHz (standard)
hello_robot_hello_stepper2.menu.maxqspi.50.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
hello_robot_hello_stepper2.menu.maxqspi.fcpu=CPU Speed / 2
hello_robot_hello_stepper2.menu.maxqspi.fcpu.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})

# Menu: USB Stack
hello_robot_hello_stepper2.menu.usbstack.arduino=Arduino
hello_robot_hello_stepper2.menu.usbstack.tinyusb=TinyUSB
hello_robot_hello_stepper2.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB

# Menu: Debug
hello_robot_hello_stepper2.menu.debug.off=Off
hello_robot_hello_stepper2.menu.debug.on=On
hello_robot_hello_stepper2.menu.debug.on.build.flags.debug=-g